; ModuleID = '/home/mohsen/AutoPatch/Testcases/CVE-Lists/CVE-2020-10021(auto)/patchedFunc.c'
source_filename = "/home/mohsen/AutoPatch/Testcases/CVE-Lists/CVE-2020-10021(auto)/patchedFunc.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.CBW = type { i32, i32, i32, i8, i8, i8, [16 x i8] }
%struct.CSW = type { i32, i32, i32, i8 }

@.str = private unnamed_addr constant [20 x i8] c"LBA (block) ; 0x%x \00", align 1
@addr = internal global i32 0, align 4, !dbg !0
@cbw = internal global %struct.CBW zeroinitializer, align 4, !dbg !13
@length = internal global i32 0, align 4, !dbg !42
@.str.1 = private unnamed_addr constant [2 x i8] c"1\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"2\00", align 1
@.str.3 = private unnamed_addr constant [2 x i8] c"3\00", align 1
@csw = internal global %struct.CSW zeroinitializer, align 4, !dbg !34

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @infoTransfer() #0 !dbg !50 {
entry:
  %retval = alloca i32, align 4
  %n = alloca i32, align 4
  %memory_size = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i32* %n, metadata !55, metadata !DIExpression()), !dbg !56
  call void @llvm.dbg.declare(metadata i32* %memory_size, metadata !57, metadata !DIExpression()), !dbg !58
  %0 = load i32, i32* %n, align 4, !dbg !59
  %call = call i32 (i8*, ...) @printf(i8* getelementptr inbounds ([20 x i8], [20 x i8]* @.str, i64 0, i64 0), i32 %0), !dbg !60
  %1 = load i32, i32* %n, align 4, !dbg !61
  %mul = mul i32 %1, 512, !dbg !63
  %2 = load i32, i32* %memory_size, align 4, !dbg !64
  %cmp = icmp uge i32 %mul, %2, !dbg !65
  br i1 %cmp, label %if.then, label %if.end, !dbg !66

if.then:                                          ; preds = %entry
  store i32 -22, i32* %retval, align 4, !dbg !67
  br label %return, !dbg !67

if.end:                                           ; preds = %entry
  %3 = load i32, i32* %n, align 4, !dbg !69
  %mul1 = mul i32 %3, 512, !dbg !70
  store i32 %mul1, i32* @addr, align 4, !dbg !71
  %4 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 0), align 1, !dbg !72
  %conv = zext i8 %4 to i32, !dbg !72
  switch i32 %conv, label %sw.epilog [
    i32 40, label %sw.bb
    i32 42, label %sw.bb
    i32 47, label %sw.bb
    i32 168, label %sw.bb5
    i32 170, label %sw.bb5
  ], !dbg !73

sw.bb:                                            ; preds = %if.end, %if.end, %if.end
  %5 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 7), align 1, !dbg !74
  %conv2 = zext i8 %5 to i32, !dbg !74
  %shl = shl i32 %conv2, 8, !dbg !76
  %6 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 8), align 1, !dbg !77
  %conv3 = zext i8 %6 to i32, !dbg !77
  %shl4 = shl i32 %conv3, 0, !dbg !78
  %or = or i32 %shl, %shl4, !dbg !79
  store i32 %or, i32* %n, align 4, !dbg !80
  br label %sw.epilog, !dbg !81

sw.bb5:                                           ; preds = %if.end, %if.end
  %7 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 6), align 1, !dbg !82
  %conv6 = zext i8 %7 to i32, !dbg !82
  %shl7 = shl i32 %conv6, 24, !dbg !83
  %8 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 7), align 1, !dbg !84
  %conv8 = zext i8 %8 to i32, !dbg !84
  %shl9 = shl i32 %conv8, 16, !dbg !85
  %or10 = or i32 %shl7, %shl9, !dbg !86
  %9 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 8), align 1, !dbg !87
  %conv11 = zext i8 %9 to i32, !dbg !87
  %shl12 = shl i32 %conv11, 8, !dbg !88
  %or13 = or i32 %or10, %shl12, !dbg !89
  %10 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 9), align 1, !dbg !90
  %conv14 = zext i8 %10 to i32, !dbg !90
  %shl15 = shl i32 %conv14, 0, !dbg !91
  %or16 = or i32 %or13, %shl15, !dbg !92
  store i32 %or16, i32* %n, align 4, !dbg !93
  br label %sw.epilog, !dbg !94

sw.epilog:                                        ; preds = %if.end, %sw.bb5, %sw.bb
  %11 = load i32, i32* %n, align 4, !dbg !95
  %mul17 = mul i32 %11, 512, !dbg !96
  store i32 %mul17, i32* @length, align 4, !dbg !97
  %12 = load i32, i32* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 2), align 4, !dbg !98
  %tobool = icmp ne i32 %12, 0, !dbg !100
  br i1 %tobool, label %if.end20, label %if.then18, !dbg !101

if.then18:                                        ; preds = %sw.epilog
  %call19 = call i32 (i8*, ...) @printf(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str.1, i64 0, i64 0)), !dbg !102
  br label %if.end20, !dbg !104

if.end20:                                         ; preds = %if.then18, %sw.epilog
  %13 = load i32, i32* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 2), align 4, !dbg !105
  %14 = load i32, i32* @length, align 4, !dbg !107
  %cmp21 = icmp ne i32 %13, %14, !dbg !108
  br i1 %cmp21, label %if.then23, label %if.end31, !dbg !109

if.then23:                                        ; preds = %if.end20
  %call24 = call i32 (i8*, ...) @printf(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str.2, i64 0, i64 0)), !dbg !110
  %15 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 3), align 4, !dbg !112
  %conv25 = zext i8 %15 to i32, !dbg !114
  %and = and i32 %conv25, 128, !dbg !115
  %cmp26 = icmp ne i32 %and, 0, !dbg !116
  br i1 %cmp26, label %if.then28, label %if.else, !dbg !117

if.then28:                                        ; preds = %if.then23
  %call29 = call i32 (i8*, ...) @printf(i8* getelementptr inbounds ([2 x i8], [2 x i8]* @.str.3, i64 0, i64 0)), !dbg !118
  br label %if.end30, !dbg !120

if.else:                                          ; preds = %if.then23
  br label %if.end30

if.end30:                                         ; preds = %if.else, %if.then28
  store i8 1, i8* getelementptr inbounds (%struct.CSW, %struct.CSW* @csw, i32 0, i32 3), align 4, !dbg !121
  store i32 -22, i32* %retval, align 4, !dbg !122
  br label %return, !dbg !122

if.end31:                                         ; preds = %if.end20
  store i32 1, i32* %retval, align 4, !dbg !123
  br label %return, !dbg !123

return:                                           ; preds = %if.end31, %if.end30, %if.then
  %16 = load i32, i32* %retval, align 4, !dbg !124
  ret i32 %16, !dbg !124
}

; Function Attrs: nofree nosync nounwind readnone speculatable willreturn
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

declare dso_local i32 @printf(i8*, ...) #2

attributes #0 = { noinline nounwind optnone uwtable "frame-pointer"="all" "min-legal-vector-width"="0" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }
attributes #1 = { nofree nosync nounwind readnone speculatable willreturn }
attributes #2 = { "frame-pointer"="all" "no-trapping-math"="true" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+cx8,+fxsr,+mmx,+sse,+sse2,+x87" "tune-cpu"="generic" }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!44, !45, !46, !47, !48}
!llvm.ident = !{!49}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "addr", scope: !2, file: !6, line: 31, type: !18, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !12, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mohsen/AutoPatch/Testcases/CVE-Lists/CVE-2020-10021(auto)/patchedFunc.c", directory: "/home/mohsen/AutoPatch/Scripts")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", file: !6, line: 53, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "Testcases/CVE-Lists/CVE-2020-10021(auto)/patchedFunc.c", directory: "/home/mohsen/AutoPatch")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11}
!9 = !DIEnumerator(name: "CSW_PASSED", value: 0)
!10 = !DIEnumerator(name: "CSW_FAILED", value: 1)
!11 = !DIEnumerator(name: "CSW_ERROR", value: 2)
!12 = !{!13, !34, !0, !42}
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "cbw", scope: !2, file: !6, line: 27, type: !15, isLocal: true, isDefinition: true)
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBW", file: !6, line: 42, size: 256, elements: !16)
!16 = !{!17, !22, !23, !24, !28, !29, !30}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !15, file: !6, line: 43, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !19, line: 26, baseType: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !21, line: 42, baseType: !7)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!22 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", scope: !15, file: !6, line: 44, baseType: !18, size: 32, offset: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !15, file: !6, line: 45, baseType: !18, size: 32, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !15, file: !6, line: 46, baseType: !25, size: 8, offset: 96)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !19, line: 24, baseType: !26)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !21, line: 38, baseType: !27)
!27 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "LUN", scope: !15, file: !6, line: 47, baseType: !25, size: 8, offset: 104)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "CBLength", scope: !15, file: !6, line: 48, baseType: !25, size: 8, offset: 112)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "CB", scope: !15, file: !6, line: 49, baseType: !31, size: 128, offset: 120)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 128, elements: !32)
!32 = !{!33}
!33 = !DISubrange(count: 16)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "csw", scope: !2, file: !6, line: 29, type: !36, isLocal: true, isDefinition: true)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CSW", file: !6, line: 35, size: 128, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !36, file: !6, line: 36, baseType: !18, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", scope: !36, file: !6, line: 37, baseType: !18, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "DataResidue", scope: !36, file: !6, line: 38, baseType: !18, size: 32, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !36, file: !6, line: 39, baseType: !25, size: 8, offset: 96)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "length", scope: !2, file: !6, line: 33, type: !18, isLocal: true, isDefinition: true)
!44 = !{i32 7, !"Dwarf Version", i32 4}
!45 = !{i32 2, !"Debug Info Version", i32 3}
!46 = !{i32 1, !"wchar_size", i32 4}
!47 = !{i32 7, !"uwtable", i32 1}
!48 = !{i32 7, !"frame-pointer", i32 2}
!49 = !{!"clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)"}
!50 = distinct !DISubprogram(name: "infoTransfer", scope: !6, file: !6, line: 73, type: !51, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !54)
!51 = !DISubroutineType(types: !52)
!52 = !{!53}
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{}
!55 = !DILocalVariable(name: "n", scope: !50, file: !6, line: 75, type: !18)
!56 = !DILocation(line: 75, column: 12, scope: !50)
!57 = !DILocalVariable(name: "memory_size", scope: !50, file: !6, line: 76, type: !18)
!58 = !DILocation(line: 76, column: 12, scope: !50)
!59 = !DILocation(line: 83, column: 32, scope: !50)
!60 = !DILocation(line: 83, column: 3, scope: !50)
!61 = !DILocation(line: 86, column: 7, scope: !62)
!62 = distinct !DILexicalBlock(scope: !50, file: !6, line: 86, column: 6)
!63 = !DILocation(line: 86, column: 9, scope: !62)
!64 = !DILocation(line: 86, column: 26, scope: !62)
!65 = !DILocation(line: 86, column: 23, scope: !62)
!66 = !DILocation(line: 86, column: 6, scope: !50)
!67 = !DILocation(line: 90, column: 2, scope: !68)
!68 = distinct !DILexicalBlock(scope: !62, file: !6, line: 86, column: 39)
!69 = !DILocation(line: 93, column: 10, scope: !50)
!70 = !DILocation(line: 93, column: 12, scope: !50)
!71 = !DILocation(line: 93, column: 8, scope: !50)
!72 = !DILocation(line: 96, column: 10, scope: !50)
!73 = !DILocation(line: 96, column: 2, scope: !50)
!74 = !DILocation(line: 100, column: 8, scope: !75)
!75 = distinct !DILexicalBlock(scope: !50, file: !6, line: 96, column: 21)
!76 = !DILocation(line: 100, column: 18, scope: !75)
!77 = !DILocation(line: 100, column: 28, scope: !75)
!78 = !DILocation(line: 100, column: 38, scope: !75)
!79 = !DILocation(line: 100, column: 25, scope: !75)
!80 = !DILocation(line: 100, column: 5, scope: !75)
!81 = !DILocation(line: 101, column: 3, scope: !75)
!82 = !DILocation(line: 104, column: 8, scope: !75)
!83 = !DILocation(line: 104, column: 18, scope: !75)
!84 = !DILocation(line: 104, column: 28, scope: !75)
!85 = !DILocation(line: 104, column: 38, scope: !75)
!86 = !DILocation(line: 104, column: 25, scope: !75)
!87 = !DILocation(line: 105, column: 5, scope: !75)
!88 = !DILocation(line: 105, column: 15, scope: !75)
!89 = !DILocation(line: 104, column: 45, scope: !75)
!90 = !DILocation(line: 105, column: 25, scope: !75)
!91 = !DILocation(line: 105, column: 35, scope: !75)
!92 = !DILocation(line: 105, column: 22, scope: !75)
!93 = !DILocation(line: 104, column: 5, scope: !75)
!94 = !DILocation(line: 106, column: 3, scope: !75)
!95 = !DILocation(line: 108, column: 11, scope: !50)
!96 = !DILocation(line: 108, column: 13, scope: !50)
!97 = !DILocation(line: 108, column: 9, scope: !50)
!98 = !DILocation(line: 109, column: 11, scope: !99)
!99 = distinct !DILexicalBlock(scope: !50, file: !6, line: 109, column: 6)
!100 = !DILocation(line: 109, column: 7, scope: !99)
!101 = !DILocation(line: 109, column: 6, scope: !50)
!102 = !DILocation(line: 110, column: 3, scope: !103)
!103 = distinct !DILexicalBlock(scope: !99, file: !6, line: 109, column: 23)
!104 = !DILocation(line: 111, column: 2, scope: !103)
!105 = !DILocation(line: 112, column: 10, scope: !106)
!106 = distinct !DILexicalBlock(scope: !50, file: !6, line: 112, column: 6)
!107 = !DILocation(line: 112, column: 24, scope: !106)
!108 = !DILocation(line: 112, column: 21, scope: !106)
!109 = !DILocation(line: 112, column: 6, scope: !50)
!110 = !DILocation(line: 114, column: 3, scope: !111)
!111 = distinct !DILexicalBlock(scope: !106, file: !6, line: 112, column: 32)
!112 = !DILocation(line: 115, column: 12, scope: !113)
!113 = distinct !DILexicalBlock(scope: !111, file: !6, line: 115, column: 7)
!114 = !DILocation(line: 115, column: 8, scope: !113)
!115 = !DILocation(line: 115, column: 18, scope: !113)
!116 = !DILocation(line: 115, column: 26, scope: !113)
!117 = !DILocation(line: 115, column: 7, scope: !111)
!118 = !DILocation(line: 117, column: 4, scope: !119)
!119 = distinct !DILexicalBlock(scope: !113, file: !6, line: 115, column: 33)
!120 = !DILocation(line: 118, column: 3, scope: !119)
!121 = !DILocation(line: 122, column: 14, scope: !111)
!122 = !DILocation(line: 123, column: 3, scope: !111)
!123 = !DILocation(line: 125, column: 3, scope: !50)
!124 = !DILocation(line: 126, column: 1, scope: !50)
