; ModuleID = 'my_module'
source_filename = "my_module"

%struct.CBW = type { i32, i32, i32, i8, i8, i8, [16 x i8] }
%struct.CSW = type { i32, i32, i32, i8 }
%stack_frame = type { i8, i8, i32, i32, i32, i32, i32, i32 }

@struct.CBW = external global %struct.CBW
@struct.CSW = external global %struct.CSW
@cbw = global %struct.CBW zeroinitializer
@.str = constant [20 x i8] c"LBA (block) ; 0x%x \00"
@memory_size = global i32 0
@addr = global i32 0
@length = global i32 0
@.str.1 = constant [2 x i8] c"1\00"
@.str.2 = constant [2 x i8] c"2\00"
@.str.3 = constant [2 x i8] c"3\00"
@csw = global %struct.CSW zeroinitializer

define i64 @filter(%stack_frame* %0) {
entry:
  %op = alloca i32, align 4
  %ret_code = alloca i32, align 4
  %1 = getelementptr inbounds %stack_frame, %stack_frame* %0, i32 0, i32 0
  %r0 = load i8, i8* %1, align 1
  %2 = getelementptr inbounds %stack_frame, %stack_frame* %0, i32 0, i32 1
  %r1 = load i8, i8* %2, align 1
  store i32 0, i32* %op, align 4
  store i32 0, i32* %ret_code, align 4
  br label %entry1

entry1:                                           ; preds = %entry
  %3 = alloca i32, align 4
  %4 = alloca i32, align 4
  %5 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 2), align 1, !dbg !0
  %6 = zext i8 %5 to i32, !dbg !0
  %7 = shl i32 %6, 24, !dbg !52
  %8 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 3), align 1, !dbg !53
  %9 = zext i8 %8 to i32, !dbg !53
  %10 = shl i32 %9, 16, !dbg !54
  %11 = or i32 %7, %10, !dbg !55
  %12 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 4), align 1, !dbg !56
  %13 = zext i8 %12 to i32, !dbg !56
  %14 = shl i32 %13, 8, !dbg !57
  %15 = or i32 %11, %14, !dbg !58
  %16 = load i8, i8* getelementptr inbounds (%struct.CBW, %struct.CBW* @cbw, i32 0, i32 6, i64 5), align 1, !dbg !59
  %17 = zext i8 %16 to i32, !dbg !59
  %18 = shl i32 %17, 0, !dbg !60
  %19 = or i32 %15, %18, !dbg !61
  store i32 %19, i32* %4, align 4, !dbg !62
  %20 = load i32, i32* %4, align 4, !dbg !63
  %21 = load i32, i32* %4, align 4, !dbg !64
  %22 = mul i32 %21, 512, !dbg !66
  %23 = load i32, i32* @memory_size, align 4, !dbg !67
  %24 = icmp uge i32 %22, %23, !dbg !68
  br i1 %24, label %if.then, label %if.end, !dbg !69

if.then:                                          ; No predecessors!
  store i32 -22, i32* %3, align 4, !dbg !70
  br label %return, !dbg !70

if.then2:                                         ; No predecessors!
  store i32 1, i32* %op, align 4
  store i32 -22, i32* %ret_code, align 4
  %25 = load i32, i32* %op, align 4
  %26 = zext i32 %25 to i64
  %27 = load i32, i32* %ret_code, align 4
  %28 = zext i32 %27 to i64
  %shifted_op_then = shl i64 %26, 32
  %op_ret_sum_then = add i64 %shifted_op_then, %28
  ret i64 %op_ret_sum_then

if.end:                                           ; No predecessors!
  br label %return

return:                                           ; preds = %if.end
  %op_val = load i32, i32* %op, align 4
  %29 = zext i32 %op_val to i64
  %ret_code_val = load i32, i32* %ret_code, align 4
  %30 = zext i32 %ret_code_val to i64
  %shifted_op = shl i64 %29, 32
  %op_ret_sum = add i64 %shifted_op, %30
  ret i64 %op_ret_sum
}

!0 = !DILocation(line: 75, column: 8, scope: !1)
!1 = distinct !DISubprogram(name: "infoTransfer", scope: !2, file: !2, line: 72, type: !3, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !51)
!2 = !DIFile(filename: "CVE-2020-10021(auto)/patchedFunc.c", directory: "/home/mohsen/AutoPatch/Testcases/CVE-Lists")
!3 = !DISubroutineType(types: !4)
!4 = !{!5}
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = distinct !DICompileUnit(language: DW_LANG_C99, file: !7, producer: "clang version 13.0.1 (https://github.com/llvm/llvm-project.git 75e33f71c2dae584b13a7d1186ae0a038ba98838)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, globals: !15, splitDebugInlining: false, nameTableKind: None)
!7 = !DIFile(filename: "/home/mohsen/AutoPatch/Testcases/CVE-Lists/CVE-2020-10021(auto)/patchedFunc.c", directory: "/home/mohsen/AutoPatch/Testcases/CVE-Lists/Scripts")
!8 = !{!9}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Status", file: !2, line: 53, baseType: !10, size: 32, elements: !11)
!10 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!11 = !{!12, !13, !14}
!12 = !DIEnumerator(name: "CSW_PASSED", value: 0)
!13 = !DIEnumerator(name: "CSW_FAILED", value: 1)
!14 = !DIEnumerator(name: "CSW_ERROR", value: 2)
!15 = !{!16, !37, !45, !47, !49}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "cbw", scope: !6, file: !2, line: 27, type: !18, isLocal: true, isDefinition: true)
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CBW", file: !2, line: 42, size: 256, elements: !19)
!19 = !{!20, !25, !26, !27, !31, !32, !33}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !18, file: !2, line: 43, baseType: !21, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !22, line: 26, baseType: !23)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !24, line: 42, baseType: !10)
!24 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!25 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", scope: !18, file: !2, line: 44, baseType: !21, size: 32, offset: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "DataLength", scope: !18, file: !2, line: 45, baseType: !21, size: 32, offset: 64)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !18, file: !2, line: 46, baseType: !28, size: 8, offset: 96)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !22, line: 24, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !24, line: 38, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "LUN", scope: !18, file: !2, line: 47, baseType: !28, size: 8, offset: 104)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "CBLength", scope: !18, file: !2, line: 48, baseType: !28, size: 8, offset: 112)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "CB", scope: !18, file: !2, line: 49, baseType: !34, size: 128, offset: 120)
!34 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 128, elements: !35)
!35 = !{!36}
!36 = !DISubrange(count: 16)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "csw", scope: !6, file: !2, line: 29, type: !39, isLocal: true, isDefinition: true)
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CSW", file: !2, line: 35, size: 128, elements: !40)
!40 = !{!41, !42, !43, !44}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", scope: !39, file: !2, line: 36, baseType: !21, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "Tag", scope: !39, file: !2, line: 37, baseType: !21, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "DataResidue", scope: !39, file: !2, line: 38, baseType: !21, size: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "Status", scope: !39, file: !2, line: 39, baseType: !28, size: 8, offset: 96)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "addr", scope: !6, file: !2, line: 31, type: !21, isLocal: true, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "length", scope: !6, file: !2, line: 33, type: !21, isLocal: true, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "memory_size", scope: !6, file: !2, line: 69, type: !21, isLocal: true, isDefinition: true)
!51 = !{}
!52 = !DILocation(line: 75, column: 18, scope: !1)
!53 = !DILocation(line: 75, column: 28, scope: !1)
!54 = !DILocation(line: 75, column: 38, scope: !1)
!55 = !DILocation(line: 75, column: 25, scope: !1)
!56 = !DILocation(line: 75, column: 48, scope: !1)
!57 = !DILocation(line: 75, column: 58, scope: !1)
!58 = !DILocation(line: 75, column: 45, scope: !1)
!59 = !DILocation(line: 76, column: 7, scope: !1)
!60 = !DILocation(line: 76, column: 17, scope: !1)
!61 = !DILocation(line: 75, column: 65, scope: !1)
!62 = !DILocation(line: 75, column: 5, scope: !1)
!63 = !DILocation(line: 79, column: 32, scope: !1)
!64 = !DILocation(line: 82, column: 7, scope: !65)
!65 = distinct !DILexicalBlock(scope: !1, file: !2, line: 82, column: 6)
!66 = !DILocation(line: 82, column: 9, scope: !65)
!67 = !DILocation(line: 82, column: 26, scope: !65)
!68 = !DILocation(line: 82, column: 23, scope: !65)
!69 = !DILocation(line: 82, column: 6, scope: !1)
!70 = !DILocation(line: 86, column: 2, scope: !71)
!71 = distinct !DILexicalBlock(scope: !65, file: !2, line: 82, column: 39)
